{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 662, 662, 3], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "conv2d_407", "class_name": "Conv2D", "config": {"name": "conv2d_407", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "batch_normalization_407", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_407", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_407", 0, 0, {}]]]}, {"name": "activation_407", "class_name": "Activation", "config": {"name": "activation_407", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_407", 0, 0, {}]]]}, {"name": "conv2d_408", "class_name": "Conv2D", "config": {"name": "conv2d_408", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_407", 0, 0, {}]]]}, {"name": "batch_normalization_408", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_408", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_408", 0, 0, {}]]]}, {"name": "activation_408", "class_name": "Activation", "config": {"name": "activation_408", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_408", 0, 0, {}]]]}, {"name": "conv2d_409", "class_name": "Conv2D", "config": {"name": "conv2d_409", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_408", 0, 0, {}]]]}, {"name": "batch_normalization_409", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_409", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_409", 0, 0, {}]]]}, {"name": "activation_409", "class_name": "Activation", "config": {"name": "activation_409", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_409", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_409", 0, 0, {}]]]}, {"name": "conv2d_410", "class_name": "Conv2D", "config": {"name": "conv2d_410", "trainable": false, "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_410", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_410", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_410", 0, 0, {}]]]}, {"name": "activation_410", "class_name": "Activation", "config": {"name": "activation_410", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_410", 0, 0, {}]]]}, {"name": "conv2d_411", "class_name": "Conv2D", "config": {"name": "conv2d_411", "trainable": false, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_410", 0, 0, {}]]]}, {"name": "batch_normalization_411", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_411", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_411", 0, 0, {}]]]}, {"name": "activation_411", "class_name": "Activation", "config": {"name": "activation_411", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_411", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": false, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_411", 0, 0, {}]]]}, {"name": "conv2d_415", "class_name": "Conv2D", "config": {"name": "conv2d_415", "trainable": false, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "batch_normalization_415", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_415", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_415", 0, 0, {}]]]}, {"name": "activation_415", "class_name": "Activation", "config": {"name": "activation_415", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_415", 0, 0, {}]]]}, {"name": "conv2d_413", "class_name": "Conv2D", "config": {"name": "conv2d_413", "trainable": false, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "conv2d_416", "class_name": "Conv2D", "config": {"name": "conv2d_416", "trainable": false, "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_415", 0, 0, {}]]]}, {"name": "batch_normalization_413", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_413", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_413", 0, 0, {}]]]}, {"name": "batch_normalization_416", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_416", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_416", 0, 0, {}]]]}, {"name": "activation_413", "class_name": "Activation", "config": {"name": "activation_413", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_413", 0, 0, {}]]]}, {"name": "activation_416", "class_name": "Activation", "config": {"name": "activation_416", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_416", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "trainable": false, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "conv2d_412", "class_name": "Conv2D", "config": {"name": "conv2d_412", "trainable": false, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "conv2d_414", "class_name": "Conv2D", "config": {"name": "conv2d_414", "trainable": false, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_413", 0, 0, {}]]]}, {"name": "conv2d_417", "class_name": "Conv2D", "config": {"name": "conv2d_417", "trainable": false, "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_416", 0, 0, {}]]]}, {"name": "conv2d_418", "class_name": "Conv2D", "config": {"name": "conv2d_418", "trainable": false, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_412", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_412", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_412", 0, 0, {}]]]}, {"name": "batch_normalization_414", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_414", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_414", 0, 0, {}]]]}, {"name": "batch_normalization_417", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_417", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_417", 0, 0, {}]]]}, {"name": "batch_normalization_418", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_418", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_418", 0, 0, {}]]]}, {"name": "activation_412", "class_name": "Activation", "config": {"name": "activation_412", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_412", 0, 0, {}]]]}, {"name": "activation_414", "class_name": "Activation", "config": {"name": "activation_414", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_414", 0, 0, {}]]]}, {"name": "activation_417", "class_name": "Activation", "config": {"name": "activation_417", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_417", 0, 0, {}]]]}, {"name": "activation_418", "class_name": "Activation", "config": {"name": "activation_418", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_418", 0, 0, {}]]]}, {"name": "mixed_5b", "class_name": "Concatenate", "config": {"name": "mixed_5b", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_412", 0, 0, {}], ["activation_414", 0, 0, {}], ["activation_417", 0, 0, {}], ["activation_418", 0, 0, {}]]]}, {"name": "conv2d_422", "class_name": "Conv2D", "config": {"name": "conv2d_422", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"name": "batch_normalization_422", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_422", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_422", 0, 0, {}]]]}, {"name": "activation_422", "class_name": "Activation", "config": {"name": "activation_422", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_422", 0, 0, {}]]]}, {"name": "conv2d_420", "class_name": "Conv2D", "config": {"name": "conv2d_420", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"name": "conv2d_423", "class_name": "Conv2D", "config": {"name": "conv2d_423", "trainable": false, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_422", 0, 0, {}]]]}, {"name": "batch_normalization_420", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_420", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_420", 0, 0, {}]]]}, {"name": "batch_normalization_423", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_423", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_423", 0, 0, {}]]]}, {"name": "activation_420", "class_name": "Activation", "config": {"name": "activation_420", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_420", 0, 0, {}]]]}, {"name": "activation_423", "class_name": "Activation", "config": {"name": "activation_423", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_423", 0, 0, {}]]]}, {"name": "conv2d_419", "class_name": "Conv2D", "config": {"name": "conv2d_419", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"name": "conv2d_421", "class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_420", 0, 0, {}]]]}, {"name": "conv2d_424", "class_name": "Conv2D", "config": {"name": "conv2d_424", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_423", 0, 0, {}]]]}, {"name": "batch_normalization_419", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_419", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_419", 0, 0, {}]]]}, {"name": "batch_normalization_421", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_421", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"name": "batch_normalization_424", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_424", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_424", 0, 0, {}]]]}, {"name": "activation_419", "class_name": "Activation", "config": {"name": "activation_419", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_419", 0, 0, {}]]]}, {"name": "activation_421", "class_name": "Activation", "config": {"name": "activation_421", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_421", 0, 0, {}]]]}, {"name": "activation_424", "class_name": "Activation", "config": {"name": "activation_424", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_424", 0, 0, {}]]]}, {"name": "block35_1_mixed", "class_name": "Concatenate", "config": {"name": "block35_1_mixed", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_419", 0, 0, {}], ["activation_421", 0, 0, {}], ["activation_424", 0, 0, {}]]]}, {"name": "block35_1_conv", "class_name": "Conv2D", "config": {"name": "block35_1_conv", "trainable": false, "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]]}, {"name": "block35_1", "class_name": "Lambda", "config": {"name": "block35_1", "trainable": false, "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpnL1VzZXJzL3Nlby1iLy52aXJ0dWFsZW52\ncy9wbGFpZDM3L2xpYi9weXRob24zLjcvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlvbnMv\naW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6oAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [80, 80, 320], "output_shape_type": "raw", "arguments": {"scale": 0.17}}, "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]]}, {"name": "block35_1_ac", "class_name": "Activation", "config": {"name": "block35_1_ac", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block35_1", 0, 0, {}]]]}, {"name": "conv2d_428", "class_name": "Conv2D", "config": {"name": "conv2d_428", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"name": "batch_normalization_428", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_428", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_428", 0, 0, {}]]]}, {"name": "activation_428", "class_name": "Activation", "config": {"name": "activation_428", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_428", 0, 0, {}]]]}, {"name": "conv2d_426", "class_name": "Conv2D", "config": {"name": "conv2d_426", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"name": "conv2d_429", "class_name": "Conv2D", "config": {"name": "conv2d_429", "trainable": false, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_428", 0, 0, {}]]]}, {"name": "batch_normalization_426", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_426", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_426", 0, 0, {}]]]}, {"name": "batch_normalization_429", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_429", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_429", 0, 0, {}]]]}, {"name": "activation_426", "class_name": "Activation", "config": {"name": "activation_426", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_426", 0, 0, {}]]]}, {"name": "activation_429", "class_name": "Activation", "config": {"name": "activation_429", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_429", 0, 0, {}]]]}, {"name": "conv2d_425", "class_name": "Conv2D", "config": {"name": "conv2d_425", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"name": "conv2d_427", "class_name": "Conv2D", "config": {"name": "conv2d_427", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_426", 0, 0, {}]]]}, {"name": "conv2d_430", "class_name": "Conv2D", "config": {"name": "conv2d_430", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_429", 0, 0, {}]]]}, {"name": "batch_normalization_425", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_425", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_425", 0, 0, {}]]]}, {"name": "batch_normalization_427", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_427", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_427", 0, 0, {}]]]}, {"name": "batch_normalization_430", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_430", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_430", 0, 0, {}]]]}, {"name": "activation_425", "class_name": "Activation", "config": {"name": "activation_425", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_425", 0, 0, {}]]]}, {"name": "activation_427", "class_name": "Activation", "config": {"name": "activation_427", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_427", 0, 0, {}]]]}, {"name": "activation_430", "class_name": "Activation", "config": {"name": "activation_430", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_430", 0, 0, {}]]]}, {"name": "block35_2_mixed", "class_name": "Concatenate", "config": {"name": "block35_2_mixed", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_425", 0, 0, {}], ["activation_427", 0, 0, {}], ["activation_430", 0, 0, {}]]]}, {"name": "block35_2_conv", "class_name": "Conv2D", "config": {"name": "block35_2_conv", "trainable": false, "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]]}, {"name": "block35_2", "class_name": "Lambda", "config": {"name": "block35_2", "trainable": false, "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpnL1VzZXJzL3Nlby1iLy52aXJ0dWFsZW52\ncy9wbGFpZDM3L2xpYi9weXRob24zLjcvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlvbnMv\naW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6oAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [80, 80, 320], "output_shape_type": "raw", "arguments": {"scale": 0.17}}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]]}, {"name": "block35_2_ac", "class_name": "Activation", "config": {"name": "block35_2_ac", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block35_2", 0, 0, {}]]]}, {"name": "conv2d_434", "class_name": "Conv2D", "config": {"name": "conv2d_434", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"name": "batch_normalization_434", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_434", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_434", 0, 0, {}]]]}, {"name": "activation_434", "class_name": "Activation", "config": {"name": "activation_434", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_434", 0, 0, {}]]]}, {"name": "conv2d_432", "class_name": "Conv2D", "config": {"name": "conv2d_432", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"name": "conv2d_435", "class_name": "Conv2D", "config": {"name": "conv2d_435", "trainable": false, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_434", 0, 0, {}]]]}, {"name": "batch_normalization_432", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_432", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_432", 0, 0, {}]]]}, {"name": "batch_normalization_435", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_435", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_435", 0, 0, {}]]]}, {"name": "activation_432", "class_name": "Activation", "config": {"name": "activation_432", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_432", 0, 0, {}]]]}, {"name": "activation_435", "class_name": "Activation", "config": {"name": "activation_435", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_435", 0, 0, {}]]]}, {"name": "conv2d_431", "class_name": "Conv2D", "config": {"name": "conv2d_431", "trainable": false, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"name": "conv2d_433", "class_name": "Conv2D", "config": {"name": "conv2d_433", "trainable": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_432", 0, 0, {}]]]}, {"name": "conv2d_436", "class_name": "Conv2D", "config": {"name": "conv2d_436", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_435", 0, 0, {}]]]}, {"name": "batch_normalization_431", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_431", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_431", 0, 0, {}]]]}, {"name": "batch_normalization_433", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_433", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_433", 0, 0, {}]]]}, {"name": "batch_normalization_436", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_436", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_436", 0, 0, {}]]]}, {"name": "activation_431", "class_name": "Activation", "config": {"name": "activation_431", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_431", 0, 0, {}]]]}, {"name": "activation_433", "class_name": "Activation", "config": {"name": "activation_433", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_433", 0, 0, {}]]]}, {"name": "activation_436", "class_name": "Activation", "config": {"name": "activation_436", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_436", 0, 0, {}]]]}, {"name": "block35_3_mixed", "class_name": "Concatenate", "config": {"name": "block35_3_mixed", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_431", 0, 0, {}], ["activation_433", 0, 0, {}], ["activation_436", 0, 0, {}]]]}, {"name": "block35_3_conv", "class_name": "Conv2D", "config": {"name": "block35_3_conv", "trainable": false, "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, 